<template>
    <div class="comp-emoji-keyboard">
        <div>
            <span v-if="isCopied" class="text-success fw-bold">copied text!!!</span>
        </div>
        <div class="input-group">
            <button v-if="!keyboardShown" @click="showKeyboard" class="btn btn-danger" type="button"
                id="button-addon1">
                <i class="bi bi-chevron-bar-down"></i>
            </button>
            <button v-if="keyboardShown" @click="hideKeyboard" class="btn btn-danger" type="button" id="button-addon1">
                <i class="bi bi-chevron-bar-up"></i>
            </button>
            <input ref="inputEmoji" v-model="text" type="text" class="form-control" placeholder="Type emojis here"
                aria-label="Type emojis here" aria-describedby="button-addon2">
            <button class="btn btn-success" type="button" id="button-addon2" @click="copyText"><i
                    class="bi bi-clipboard"></i> Copy</button>
        </div>
        <div class="accordion-item">
            <div id="collapseKeyboard" class="accordion-collapse collapse" aria-labelledby="headingOne"
                data-bs-parent="#accordionExample">
                <div class="accordion-body">
                    <div class="simple-keyboard"></div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
import { Collapse } from 'bootstrap/dist/js/bootstrap.bundle.min';
import Keyboard from 'simple-keyboard';
import 'simple-keyboard/build/css/index.css';

export default {
    name: 'CompEmojiKeyboard',
    data: () => ({
        keyboard: null,
        text: null,
        isCopied: false,
        keyboardShown: false,
        collapseKeyboard: null,
    }),
    mounted() {
        this.collapseKeyboard = new Collapse('#collapseKeyboard', {
            toggle: false
        });

        this.keyboard = new Keyboard({
            onChange: input => this.onChange(input),
            onKeyPress: button => this.onKeyPress(button),
            theme: "hg-theme-default",
            layoutName: 'default',
            layout: {
                'default': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '😀 😃 😄 😁 😆 😅 😂 🤣 🥲 🥹 ☺️ 😊',
                    '😇 🙂 🙃 😉 😌 😍 🥰 😘 😗 😙 😚 😋',
                    '😛 😝 😜 🤪 🤨 🧐 🤓 😎 🥸 🤩 🥳 🙂‍↕️',
                    '😏 😒 🙂‍↔️ 😞 😔 😟 😕 🙁 ☹️ 😣 😖 😫',
                    '😩 🥺 😢 😭 😮‍💨 😤 😠 😡 🤬 🤯 😳 🥵',
                    '🥶 😱 😨 😰 😥 😓 🫣 🤗 🫡 🤔 🫢 🤭',
                    '🤫 🤥 😶 😶‍🌫️ 😐 😑 😬 🫨 🫠 🙄 😯 😦',
                    '😧 😮 😲 🥱 😴 🤤 😪 😵 😵‍💫 🫥 🤐 🥴',
                    '🤢 🤮 🤧 😷 🤒 🤕 🤑 🤠 😈 👿 👹 👺',
                    '🤡 💩 👻 💀 ☠️ 👽 👾 🤖 🎃 😺 😸 😹',
                    '😻 😼 😽 🙀 😿 😾 {backspace}',
                ],
                'gestures': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '👋 🤚 🖐 ✋ 🖖 👌 🤌 🤏 ✌️ 🤞 🫰 🤟',
                    '🤘 🤙 🫵 🫱 🫲 🫸 🫷 🫳 🫴 👈 👉 👆',
                    '🖕 👇 ☝️ 👍 👎 ✊ 👊 🤛 🤜 👏 🫶 🙌',
                    '👐 🤲 🤝 🙏 ✍️ 💅 🤳 💪 🦾 🦵 🦿 🦶',
                    '👣 👂 🦻 👃 🫀 🫁 🧠 🦷 🦴 👀 👁 👅',
                    '👄 🫦 💋 🩸 {backspace}'
                ],
                'people': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '👶 👧 🧒 👦 👩 🧑 👨 👩‍🦱 🧑‍🦱 👨‍🦱 👩‍🦰 🧑‍🦰',
                    '👨‍🦰 👱‍♀️ 👱 👱‍♂️ 👩‍🦳 🧑‍🦳 👨‍🦳 👩‍🦲 🧑‍🦲 👨‍🦲 🧔‍♀️ 🧔',
                    '🧔‍♂️ 👵 🧓 👴 👲 👳‍♀️ 👳 👳‍♂️ 🧕 👮‍♀️ 👮 👮‍♂️',
                    '👷‍♀️ 👷 👷‍♂️ 💂‍♀️ 💂 💂‍♂️ 🕵️‍♀️ 🕵️ 🕵️‍♂️ 👩‍⚕️ 🧑‍⚕️ 👨‍⚕️',
                    '👩‍🌾 🧑‍🌾 👨‍🌾 👩‍🍳 🧑‍🍳 👨‍🍳 👩‍🎓 🧑‍🎓 👨‍🎓 👩‍🎤 🧑‍🎤 👨‍🎤',
                    '👩‍🏫 🧑‍🏫 👨‍🏫 👩‍🏭 🧑‍🏭 👨‍🏭 👩‍💻 🧑‍💻 👨‍💻 👩‍💼 🧑‍💼 👨‍💼',
                    '👩‍🔧 🧑‍🔧 👨‍🔧 👩‍🔬 🧑‍🔬 👨‍🔬 👩‍🎨 🧑‍🎨 👨‍🎨 👩‍🚒 🧑‍🚒 👨‍🚒',
                    '👩‍✈️ 🧑‍✈️ 👨‍✈️ 👩‍🚀 🧑‍🚀 👨‍🚀 👩‍⚖️ 🧑‍⚖️ 👨‍⚖️ 👰‍♀️ 👰 👰‍♂️',
                    '🤵‍♀️ 🤵 🤵‍♂️ 👸 🫅 🤴 🥷 🦸‍♀️ 🦸 🦸‍♂️ 🦹‍♀️ 🦹',
                    '🦹‍♂️ 🤶 🧑‍🎄 🎅 🧙‍♀️ 🧙 🧙‍♂️ 🧝‍♀️ 🧝 🧝‍♂️ 🧛‍♀️ 🧛',
                    '🧛‍♂️ 🧟‍♀️ 🧟 🧟‍♂️ 🧞‍♀️ 🧞 🧞‍♂️ 🧜‍♀️ 🧜 🧜‍♂️ 🧚‍♀️ 🧚',
                    '🧚‍♂️ 🧌 👼 🤰 🫄 🫃 🤱 👩‍🍼 🧑‍🍼 👨‍🍼 🙇‍♀️ 🙇',
                    '🙇‍♂️ 💁‍♀️ 💁 💁‍♂️ 🙅‍♀️ 🙅 🙅‍♂️ 🙆‍♀️ 🙆 🙆‍♂️ 🙋‍♀️ 🙋',
                    '🙋‍♂️ 🧏‍♀️ 🧏 🧏‍♂️ 🤦‍♀️ 🤦 🤦‍♂️ 🤷‍♀️ 🤷 🤷‍♂️ 🙎‍♀️ 🙎',
                    '🙎‍♂️ 🙍‍♀️ 🙍 🙍‍♂️ 💇‍♀️ 💇 💇‍♂️ 💆‍♀️ 💆 💆‍♂️ 🧖‍♀️ 🧖',
                    '🧖‍♂️ 💅 🤳 💃 🕺 👯‍♀️ 👯 👯‍♂️ 🕴 👩‍🦽 👩‍🦽‍➡️ 🧑‍🦽',
                    '🧑‍🦽‍➡️ 👨‍🦽 👨‍🦽‍➡️ 👩‍🦼 👩‍🦼‍➡️ 🧑‍🦼 🧑‍🦼‍➡️ 👨‍🦼 👨‍🦼‍➡️ 🚶‍♀️ 🚶‍♀️‍➡️ 🚶',
                    '🚶‍➡️ 🚶‍♂️ 🚶‍♂️‍➡️ 👩‍🦯 👩‍🦯‍➡️ 🧑‍🦯 🧑‍🦯‍➡️ 👨‍🦯 👨‍🦯‍➡️ 🧎‍♀️ 🧎‍♀️‍➡️ 🧎',
                    '🧎‍➡️ 🧎‍♂️ 🧎‍♂️‍➡️ 🏃‍♀️ 🏃‍♀️‍➡️ 🏃 🏃‍➡️ 🏃‍♂️ 🏃‍♂️‍➡️ 🧍‍♀️ 🧍 🧍‍♂️',
                    '👭 🧑‍🤝‍🧑 👬 👫 👩‍❤️‍👩 💑 👨‍❤️‍👨 👩‍❤️‍👨 👩‍❤️‍💋‍👩 💏 👨‍❤️‍💋‍👨 👩‍❤️‍💋‍👨',
                    '👪 👨‍👩‍👦 👨‍👩‍👧 👨‍👩‍👧‍👦 👨‍👩‍👦‍👦 👨‍👩‍👧‍👧 👨‍👨‍👦 👨‍👨‍👧 👨‍👨‍👧‍👦 👨‍👨‍👦‍👦 👨‍👨‍👧‍👧 👩‍👩‍👦',
                    '👩‍👩‍👧 👩‍👩‍👧‍👦 👩‍👩‍👦‍👦 👩‍👩‍👧‍👧 👨‍👦 👨‍👦‍👦 👨‍👧 👨‍👧‍👦 👨‍👧‍👧 👩‍👦 👩‍👦‍👦 👩‍👧',
                    '👩‍👧‍👦 👩‍👧‍👧 🧑‍🧑‍🧒 🧑‍🧑‍🧒‍🧒 🧑‍🧒 🧑‍🧒‍🧒 🗣 👤 👥 🫂 {backspace}'
                ],
                'accessories': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '🧳 🌂 ☂️ 🧵 🪡 🪢 🪭 🧶 👓 🕶 🥽 🥼',
                    '🥼 🦺 👔 👕 👖 🧣 🧤 🧥 🧦 👗 👘',
                    '🥻 🩴 🩱 🩲 🩳 👙 👚 👛 👜 👝 🎒',
                    '👞 👟 🥾 🥿 👠 👡 🩰 👢 👑 👒 🎩',
                    '🎓 🧢 ⛑ 🪖 💄 💍 💼 {backspace}'
                ],
                'nature': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '🐶 🐱 🐭 🐹 🐰 🦊 🐻 🐼 🐻‍❄️ 🐨 🐯 🦁',
                    '🐮 🐷 🐽 🐸 🐵 🙈 🙉 🙊 🐒 🐔 🐧 🐦',
                    '🐦‍⬛ 🐤 🐣 🐥 🦆 🦅 🦉 🦇 🐺 🐗 🐴 🦄',
                    '🐝 🪱 🐛 🦋 🐌 🐞 🐜 🪰 🪲 🪳 🦟 🦗',
                    '🕷 🕸 🦂 🐢 🐍 🦎 🦖 🦕 🐙 🦑 🦐 🦞',
                    '🦀 🪼 🪸 🐡 🐠 🐟 🐬 🐳 🐋 🦈 🐊 🐅',
                    '🐆 🦓 🫏 🦍 🦧 🦣 🐘 🦛 🦏 🐪 🐫 🦒',
                    '🦘 🦬 🐃 🐂 🐄 🐎 🐖 🐏 🐑 🦙 🐐 🦌',
                    '🫎 🐕 🐩 🦮 🐕‍🦺 🐈 🐈‍⬛ 🪽 🪶 🐓 🦃 🦤',
                    '🦚 🦜 🦢 🪿 🦩 🕊 🐇 🦝 🦨 🦡 🦫 🦦',
                    '🦥 🐁 🐀 🐿 🦔 🐾 🐉 🐲 🐦‍🔥 🌵 🎄 🌲',
                    '🌳 🪾 🌴 🪹 🪺 🪵 🌱 🌿 ☘️ 🍀 🎍 🪴',
                    '🎋 🍃 🍂 🍁 🍄 🍄‍🟫 🐚 🪨 🌾 💐 🌷 🪷',
                    '🌹 🥀 🌺 🌸 🪻 🌼 🌻 🌞 🌝 🌛 🌜 🌚',
                    '🌕 🌖 🌗 🌘 🌑 🌒 🌓 🌔 🌙 🌎 🌍 🌏',
                    '🪐 💫 ⭐️ 🌟 ✨ ⚡️ ☄️ 💥 🔥 🌪 🌈 ☀️',
                    '🌤 ⛅️ 🌥 ☁️ 🌦 🌧 ⛈ 🌩 🌨 ❄️ ☃️ ⛄️',
                    '🌬 💨 💧 💦 🫧 ☔️ ☂️ 🌊 {backspace}'
                ],
                'food': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '🍏 🍎 🍐 🍊 🍋 🍋‍🟩 🍌 🍉 🍇 🍓 🫐 🍈',
                    '🍒 🍑 🥭 🍍 🥥 🥝 🍅 🍆 🥑 🥦 🫛 🥬',
                    '🥒 🌶 🫑 🌽 🥕 🫒 🧄 🧅 🫚 🥔 🍠 🫘',
                    '🥐 🥯 🍞 🥖 🥨 🧀 🥚 🍳 🧈 🥞 🧇 🥓',
                    '🥩 🍗 🍖 🦴 🌭 🍔 🍟 🍕 🫓 🥪 🥙 🧆',
                    '🌮 🌯 🫔 🥗 🥘 🫕 🥫 🍝 🍜 🍲 🍛 🍣',
                    '🍱 🥟 🦪 🍤 🍙 🍚 🍘 🍥 🥠 🥮 🍢 🍡',
                    '🍧 🍨 🍦 🥧 🧁 🍰 🎂 🍮 🍭 🍬 🍫 🍿',
                    '🍩 🍪 🌰 🥜 🍯 🥛 🍼 🫖 ☕️ 🍵 🧃 🥤',
                    '🧋 🫙 🍶 🍺 🍻 🥂 🍷 🫗 🥃 🍸 🍹 🧉',
                    '🍾 🧊 🥄 🍴 🍽 🥣 🥡 🥢 🧂 {backspace}',
                ],
                'activities': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '⚽️ 🏀 🏈 ⚾️ 🥎 🎾 🏐 🏉 🥏 🎱 🪀 🏓',
                    '🏸 🏒 🏑 🥍 🏏 🪃 🥅 ⛳️ 🪁 🏹 🎣 🤿',
                    '🥊 🥋 🎽 🛹 🛼 🛷 ⛸ 🥌 🎿 ⛷ 🏂 🪂',
                    '🏋️‍♀️ 🏋️ 🏋️‍♂️ 🤼‍♀️ 🤼 🤼‍♂️ 🤸‍♀️ 🤸 🤸‍♂️ ⛹️‍♀️ ⛹️ ⛹️‍♂️',
                    '🤺 🤾‍♀️ 🤾 🤾‍♂️ 🏌️‍♀️ 🏌️ 🏌️‍♂️ 🏇 🧘‍♀️ 🧘 🧘‍♂️ 🏄‍♀️',
                    '🏄 🏄‍♂️ 🏊‍♀️ 🏊 🏊‍♂️ 🤽‍♀️ 🤽 🤽‍♂️ 🚣‍♀️ 🚣 🚣‍♂️ 🧗‍♀️',
                    '🧗 🧗‍♂️ 🚵‍♀️ 🚵 🚵‍♂️ 🚴‍♀️ 🚴 🚴‍♂️ 🏆 🥇 🥈 🥉',
                    '🏅 🎖 🏵 🎗 🎫 🎟 🎪 🤹 🤹‍♂️ 🤹‍♀️ 🎭 🩰',
                    '🎨 🎬 🎤 🎧 🎼 🎹 🥁 🪘 🪇 🎷 🎺 🪗',
                    '🎸 🪕 🎻 🪈 🎲 ♟ 🎯 🎳 🎮 🎰 🧩 {backspace}'
                ],
                'travels': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '🚗 🚕 🚙 🚌 🚎 🏎 🚓 🚑 🚒 🚐 🛻 🚚',
                    '🚛 🚜 🦯 🦽 🦼 🛴 🚲 🛵 🏍 🛺 🚨 🚔',
                    '🚍 🚘 🚖 🛞 🚡 🚠 🚟 🚃 🚋 🚞 🚝 🚄',
                    '🚅 🚈 🚂 🚆 🚇 🚊 🚉 ✈️ 🛫 🛬 🛩 💺',
                    '🛰 🚀 🛸 🚁 🛶 ⛵️ 🚤 🛥 🛳 ⛴ 🚢 ⚓️',
                    '🛟 🪝 ⛽️ 🚧 🚦 🚥 🚏 🗺 🗿 🗽 🗼 🏰',
                    '🏯 🏟 🎡 🎢 🛝 🎠 ⛲️ ⛱ 🏖 🏝 🏜 🌋',
                    '⛰ 🏔 🗻 🏕 ⛺️ 🛖 🏠 🏡 🏘 🏚 🏗 🏭',
                    '🏢 🏬 🏣 🏤 🏥 🏦 🏨 🏪 🏫 🏩 💒 🏛',
                    '⛪️ 🕌 🕍 🛕 🕋 ⛩ 🛤 🛣 🗾 🎑 🏞 🌅',
                    '🌄 🌠 🎇 🎆 🌇 🌆 🏙 🌃 🌌 🌉 🌁 {backspace}'
                ],
                'objects': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '⌚️ 📱 📲 💻 ⌨️ 🖥 🖨 🖱 🖲 🕹 🗜 💽',
                    '💾 💿 📀 📼 📷 📸 📹 🎥 📽 🎞 📞 ☎️',
                    '📟 📠 📺 📻 🎙 🎚 🎛 🧭 ⏱ ⏲ ⏰ 🕰',
                    '⌛️ ⏳ 📡 🔋 🪫 🔌 💡 🔦 🕯 🪔 🧯 🛢',
                    '🛍️ 💸 💵 💴 💶 💷 🪙 💰 💳 💎 ⚖️ 🪮',
                    '🪜 🧰 🪛 🔧 🔨 ⚒ 🛠 ⛏ 🪚 🔩 ⚙️ 🪤',
                    '🧱 ⛓ ⛓️‍💥 🧲 🔫 💣 🧨 🪓 🔪 🗡 ⚔️ 🛡',
                    '🚬 ⚰️ 🪦 ⚱️ 🏺 🔮 📿 🧿 🪬 💈 ⚗️ 🔭',
                    '🔬 🕳 🩹 🩺 🩻 🩼 💊 💉 🩸 🧬 🦠 🧫',
                    '🧪 🌡 🧹 🪠 🧺 🧻 🚽 🚰 🚿 🛁 🛀 🧼',
                    '🪥 🪒 🧽 🪣 🧴 🛎 🔑 🗝 🚪 🪑 🛋 🛏',
                    '🛌 🧸 🪆 🖼 🪞 🪟 🛍 🛒 🎁 🎈 🎏 🎀',
                    '🪄 🪅 🎊 🎉 🪩 🎎 🏮 🎐 🧧 ✉️ 📩 📨',
                    '📧 💌 📥 📤 📦 🏷 🪧 📪 📫 📬 📭 📮',
                    '📯 📜 📃 📄 📑 🧾 📊 📈 📉 🗒 🗓 📆',
                    '📅 🗑 🪪 📇 🗃 🗳 🗄 📋 📁 📂 🗂 🗞',
                    '📰 📓 📔 📒 📕 📗 📘 📙 📚 📖 🔖 🧷',
                    '🔗 📎 🖇 📐 📏 🧮 📌 📍 ✂️ 🖊 🖋 ✒️',
                    '🖌 🖍 📝 ✏️ 🔍 🔎 🔏 🔐 🔒 🔓 {backspace}'
                ],
                'symbols': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '❤️ 🩷 🧡 💛 💚 💙 🩵 💜 🖤 🩶 🤍 🤎',
                    '❤️‍🔥 ❤️‍🩹 💔 ❣️ 💕 💞 💓 💗 💖 💘 💝 💟',
                    '☮️ ✝️ ☪️ 🪯 🕉 ☸️ ✡️ 🔯 🕎 ☯️ ☦️ 🛐',
                    '⛎ ♈️ ♉️ ♊️ ♋️ ♌️ ♍️ ♎️ ♏️ ♐️ ♑️ ♒️',
                    '♓️ 🆔 ⚛️ 🉑 ☢️ ☣️ 📴 📳 🈶 🈚️ 🈸 🈺',
                    '🈷️ ✴️ 🆚 💮 🉐 ㊙️ ㊗️ 🈴 🈵 🈹 🈲 🅰️',
                    '🅱️ 🆎 🆑 🅾️ 🆘 ❌ ⭕️ 🛑 ⛔️ 📛 🚫 💯',
                    '🫟 💢 ♨️ 🚷 🚯 🚳 🚱 🔞 📵 🚭 ❗️ ❕',
                    '❓ ❔ ‼️ ⁉️ 🔅 🔆 〽️ ⚠️ 🚸 🔱 ⚜️ 🔰',
                    '♻️ ✅ 🈯️ 💹 ❇️ ✳️ ❎ 🌐 💠 Ⓜ️ 🌀 💤',
                    '🏧 🚾 ♿️ 🅿️ 🛗 🈳 🈂️ 🛂 🛃 🛄 🛅 🚹',
                    '🚺 🚼 ⚧ 🚻 🚮 🎦 🛜 📶 🈁 🔣 ℹ️ 🔤',
                    '🔡 🔠 🆖 🆗 🆙 🆒 🆕 🆓 0️⃣ 1️⃣ 2️⃣ 3️⃣',
                    '4️⃣ 5️⃣ 6️⃣ 7️⃣ 8️⃣ 9️⃣ 🔟 🔢 #️⃣ *️⃣ ⏏️ ▶️',
                    '⏸ ⏯ ⏹ ⏺ ⏭ ⏮ ⏩ ⏪ ⏫ ⏬ ◀️ 🔼',
                    '🔽 ➡️ ⬅️ ⬆️ ⬇️ ↗️ ↘️ ↙️ ↖️ ↕️ ↔️ ↪️',
                    '↩️ ⤴️ ⤵️ 🔀 🔁 🔂 🔄 🔃 🎵 🎶 ➕ ➖',
                    '➗ ✖️ 🟰 ♾ 💲 💱 ™️ ©️ ®️ 〰️ ➰ ➿',
                    '🔚 🔙 🔛 🔝 🔜 ✔️ ☑️ 🔘 🔴 🟠 🟡 🟢',
                    '🔵 🟣 ⚫️ ⚪️ 🟤 🔺 🔻 🔸 🔹 🔶 🔷 🔳',
                    '🔲 ▪️ ▫️ ◾️ ◽️ ◼️ ◻️ 🟥 🟧 🟨 🟩 🟦',
                    '🟪 ⬛️ ⬜️ 🟫 🔈 🔇 🔉 🔊 🔔 🔕 📣 📢',
                    '👁‍🗨 💬 💭 🗯 ♠️ ♣️ ♥️ ♦️ 🃏 🎴 🀄️ 🕐',
                    '🕑 🕒 🕓 🕔 🕕 🕖 🕗 🕘 🕙 🕚 🕛 🕜',
                    '{backspace}'
                ],
                'flags': [
                    '{default} {gestures} {people}',
                    '{accessories} {nature} {food}',
                    '{activities} {travels} {objects} {symbols} {flags}',
                    '🏳️ 🏴 🏁 🚩 🏳️‍🌈 🏳️‍⚧️ 🏴‍☠️ 🇦🇫 🇦🇽 🇦🇱 🇩🇿 🇦🇸',
                    '🇦🇩 🇦🇴 🇦🇮 🇦🇶 🇦🇬 🇦🇷 🇦🇲 🇦🇼 🇦🇺 🇦🇹 🇦🇿 🇧🇸',
                    '🇧🇭 🇧🇩 🇧🇧 🇧🇾 🇧🇪 🇧🇿 🇧🇯 🇧🇲 🇧🇹 🇧🇴 🇧🇦 🇧🇼',
                    '🇧🇷 🇮🇴 🇻🇬 🇧🇳 🇧🇬 🇧🇫 🇧🇮 🇰🇭 🇨🇲 🇨🇦 🇮🇨 🇨🇻',
                    '🇧🇶 🇰🇾 🇨🇫 🇹🇩 🇨🇱 🇨🇳 🇨🇽 🇨🇨 🇨🇴 🇨🇵 🇰🇲 🇨🇬',
                    '🇨🇩 🇨🇰 🇨🇶 🇨🇷 🇨🇮 🇭🇷 🇨🇺 🇨🇼 🇨🇾 🇨🇿 🇩🇰 🇩🇯',
                    '🇩🇲 🇩🇴 🇪🇨 🇪🇬 🇸🇻 🇬🇶 🇪🇷 🇪🇪 🇪🇹 🇪🇺 🇫🇰 🇫🇴',
                    '🇫🇯 🇫🇮 🇫🇷 🇬🇫 🇵🇫 🇹🇫 🇬🇦 🇬🇲 🇬🇪 🇩🇪 🇬🇭 🇬🇮',
                    '🇬🇷 🇬🇱 🇬🇩 🇬🇵 🇬🇺 🇬🇹 🇬🇬 🇬🇳 🇬🇼 🇬🇾 🇭🇹 🇭🇳',
                    '🇭🇰 🇭🇺 🇮🇸 🇮🇳 🇮🇩 🇮🇷 🇮🇶 🇮🇪 🇮🇲 🇮🇱 🇮🇹 🇯🇲',
                    '🇯🇵 🎌 🇯🇪 🇯🇴 🇰🇿 🇰🇪 🇰🇮 🇽🇰 🇰🇼 🇰🇬 🇱🇦 🇱🇻',
                    '🇱🇧 🇱🇸 🇱🇷 🇱🇾 🇱🇮 🇱🇹 🇱🇺 🇲🇴 🇲🇰 🇲🇬 🇲🇼 🇲🇾',
                    '🇲🇻 🇲🇱 🇲🇹 🇲🇭 🇲🇶 🇲🇷 🇲🇺 🇾🇹 🇲🇽 🇫🇲 🇲🇩 🇲🇨',
                    '🇲🇳 🇲🇪 🇲🇸 🇲🇦 🇲🇿 🇲🇲 🇳🇦 🇳🇷 🇳🇵 🇳🇱 🇳🇨 🇳🇿',
                    '🇳🇮 🇳🇪 🇳🇬 🇳🇺 🇳🇫 🇰🇵 🇲🇵 🇳🇴 🇴🇲 🇵🇰 🇵🇼 🇵🇸',
                    '🇵🇦 🇵🇬 🇵🇾 🇵🇪 🇵🇭 🇵🇳 🇵🇱 🇵🇹 🇵🇷 🇶🇦 🇷🇪 🇷🇴',
                    '🇷🇺 🇷🇼 🇼🇸 🇸🇲 🇸🇦 🇸🇳 🇷🇸 🇸🇨 🇸🇱 🇸🇬 🇸🇽 🇸🇰',
                    '🇸🇮 🇬🇸 🇸🇧 🇸🇴 🇿🇦 🇰🇷 🇸🇸 🇪🇸 🇱🇰 🇧🇱 🇸🇭 🇰🇳',
                    '🇱🇨 🇵🇲 🇻🇨 🇸🇩 🇸🇷 🇸🇿 🇸🇪 🇨🇭 🇸🇾 🇹🇼 🇹🇯 🇹🇿',
                    '🇹🇭 🇹🇱 🇹🇬 🇹🇰 🇹🇴 🇹🇹 🇹🇳 🇹🇷 🇹🇲 🇹🇨 🇹🇻 🇻🇮',
                    '🇺🇬 🇺🇦 🇦🇪 🇬🇧 🏴 🏴 🏴 🇺🇳 🇺🇸 🇺🇾 🇺🇿 🇻🇺',
                    '🇻🇦 🇻🇪 🇻🇳 🇼🇫 🇪🇭 🇾🇪 🇿🇲 🇿🇼 {backspace}'
                ]
            },
            display: {
                '{default}': 'Smileys 😀',
                '{gestures}': 'Gestures and Body Parts 👋',
                '{people}': 'People and Fantasy 👶',
                '{accessories}': 'Clothing and Accessories 🧳',
                '{nature}': 'Animals & Nature 🐶',
                '{food}': 'Food & Drink 🍏',
                '{activities}': 'Activity and Sports ⚽️',
                '{travels}': 'Travel & Places 🚗',
                '{objects}': 'Objects ⌚️',
                '{symbols}': 'Symbols ❤️',
                '{flags}': 'Flags 🏳️',
                '{backspace}': '<span class="text-danger fw-bold">⌫ Delete</span>'
            },
            buttonTheme: [

            ]
        });
    },
    methods: {
        onChange(input) {
            this.text = input;
            console.log("Input changed", input);
        },
        onKeyPress(button) {
            console.log("Button pressed", button);
            switch (button) {
                case '{default}':
                    this.keyboard.setOptions({
                        layoutName: 'default'
                    });
                    break;
                case '{gestures}':
                    this.keyboard.setOptions({
                        layoutName: 'gestures'
                    });
                    break;
                case '{people}':
                    this.keyboard.setOptions({
                        layoutName: 'people'
                    });
                    break;
                case '{accessories}':
                    this.keyboard.setOptions({
                        layoutName: 'accessories'
                    });
                    break;
                case '{nature}':
                    this.keyboard.setOptions({
                        layoutName: 'nature'
                    });
                    break;
                case '{food}':
                    this.keyboard.setOptions({
                        layoutName: 'food'
                    });
                    break;
                case '{activities}':
                    this.keyboard.setOptions({
                        layoutName: 'activities'
                    });
                    break;
                case '{travels}':
                    this.keyboard.setOptions({
                        layoutName: 'travels'
                    });
                    break;
                case '{objects}':
                    this.keyboard.setOptions({
                        layoutName: 'objects'
                    });
                    break;
                case '{symbols}':
                    this.keyboard.setOptions({
                        layoutName: 'symbols'
                    });
                    break;
                case '{flags}':
                    this.keyboard.setOptions({
                        layoutName: 'flags'
                    });
                    break;
            }
        },
        copyText() {
            navigator.clipboard.writeText(this.text).then(() => {
                this.$refs.inputEmoji.select();
                this.isCopied = true;
                setTimeout(() => {
                    this.isCopied = false;
                }, 5000);
            }).catch(err => {
                console.error('Failed to copy text: ', err);
            });
        },
        showKeyboard() {
            this.keyboardShown = true;
            this.collapseKeyboard.show();
        },
        hideKeyboard() {
            this.keyboardShown = false;
            this.collapseKeyboard.hide();
        },
    }
}
</script>

<style>
.categoryBtn {
    background-color: khaki;
}
</style>